test = ['9折优惠']
test[0].replace("9折优惠", "九折优化")
print(test)

temp = "你好9折优惠"
print(temp.replace("9折优惠", "九折优化"))
ocr_result = [[['主', '85C', '3105. 69', '2971. 06', '176000', '23693120'], ['尖峰', '270. 99', '259.54', '203440'],
               ['峰', '740. 43', '718.03', '392400'], ['平', '1086. 93', '1031.01', '9841920'],
               ['谷', '1007. 3', '962. 46', '088869'], ['无', '552.03', '524. 02', '29760'], ['无', '7.', '7. 14'],
               ['父情MD', '0. 2233', '39301'], ['情D', '0.2326', '0938'],
               ['任谷MD', '0.2202', '38755', '0. 226', '39846'], ['主', '115', '30', '2974', '130'],
               ['尖峰', '270', '259', '11'], ['峰', '749', '718', '22'], ['平', '1086', '1032', '54'],
               ['谷', '1097', '963', '4.4'], ['无', '55', '524', '27'], ['无', '>', '>'],
               ['尖峰MD', 'G', '0', '0', 'MD', 'G', '0'], ['谷MD', 'G', 'D']],
              [['基本电费1', '50609.00', '38.400', '1943385.60', '9折优惠', '0.00', '0.000', '-194338.56'],
               ['大工业（分时）-5尖峰', '2972640', '4745522.50'], ['大工业（分时）-5峰', '11919600', '15292131.62'],
               ['大工业（分时）-5平', '8933760', '6483140.29'], ['大工业（分时）-5谷', '11874720', '3654326.33'],
               ['其中输配费用', '4713944.37'], ['其中代征费用', '1039426.46'], ['其中上网环节线损', '844912.84'],
               ['其中电价交叉补贴新', '627410.52'], ['增损益'], ['其中抽水蓄能容量电', '412836.11'], ['费'],
               ['其中燃气机组容量电', '1208810.93'], ['费'], ['其中电力保障综合费', '1066597.88'], ['用'],
               ['小计', '31924167.78'], ['力率调整', '-231635.56'], ['偏差考核合计', '0.00'], ['分成选项费用', '0.00'],
               ['服务收益支出', '0.00']]]
res_dict = {}
f_info = "omfp"
h1 = 1
h2 = 2
h3 = 3
h4 = 4
h5 = 5
h6 = 6
for result in ocr_result:
    i = 0
    for res in result:
        dianfei1 = ""
        dianfei2 = ""
        dianjia = ""
        if res[0] in ['尖峰', '峰', '平', '谷']:
            res_dict["imgC" + str(i)] = f_info
        if res[0] in ['基本电费', '基本电费1']:
            dianjia = res[2]
            print(dianjia)
            info = h1 if dianjia == "40.800" else h2 if dianjia == "38.400" else h3 if dianjia == "25.500" else h4
            res_dict["imgD" + str(i)] = info
            dianfei1 = res[3]
        if res[0] == '基本电费2':
            dianjia = res[2]
            info = h5 if dianjia == "81.6" else h6
            res_dict["imgD" + str(i)] = info
            dianfei2 = res[3]
        if res[0] == '9折优惠':
            base_dianfei = float(dianfei1) if not dianfei1 else 0
            base_dianfei2 = float(dianfei2) if not dianfei2 else 0
            dianjia = res[2]
            t_dianfei = base_dianfei + base_dianfei2
            info = f"您是按需量计收基本电费的两部制工商业用户。您本月户总有功电量/合同容量≧260，可享受基本电费9折优惠。9折优惠金额={t_dianfei}*（-10%）"
            res_dict["imgD" + str(i)] = info
        i += 1
print(res_dict)
